<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Insert title here</title>
</head>
<style>
body{
text-indent: 2em;
line-height: 150%;
}
</style>
<body>
<h1>北京大学软件工程研究所概况</h1>
<p> 
    北京大学软件工程研究所是一个专注于软件工程及其相关领域的研究和实践的学术机构，其前身是1983年建立的软件工程教研室，1999年正式挂牌成为北京大学的一个专业研究所。从1999年至2003年8月，杨芙清院士担任研究所所长。从2003年9月开始，梅宏教授任研究所所长，杨芙清院士任研究所名誉所长。

    研究所的任务是：加强在软件工程及其相关领域的学术研究，出国际水平的研究成果；加强软件工程技术实践，直接服务于我国软件产业的建设；培养软件技术和管理方面的高级研究人才和工程人才，适应我国软件技术研究和软件产业发展的需要。

    北京大学软件工程研究所一直承担着重要的国家级科研项目（包括国家科技攻关项目、国家863高技术计划项目、国家发改委高新技术产业化专项、国家信息产业部项目、国家973项目、国家教育部项目、国家自然科学基金项目、中国博士后科学基金项目等）的研究工作，同时也承担了很多横向合作项目（包括国际合作研究、面向软件企业的技术服务及咨询等）的研究工作，科研成果斐然，多次获得国家级和部委级的表彰和奖励，为我国软件技术和软件产业的发展做出了积极贡献。
</p>
   	<p>研究所的主要研究方向包括：
    <ol>
    <li>软件工程基础理论</li>
    <li>软件工业化生产技术与系统</li>
    <li>软件复用与软件构件技术</li>
    <li>面向对象方法与技术</li>
    <li>操作系统与系统软件</li>
    <li>中间件技术</li>
    <li>网络软件与特征交互</li>
    <li>程序理解技术与逆向工程</li>
    <li>软件过程管理</li>
    </ol>
    
	<p>
    研究所还承担了计算机科学与技术学科大量的基础课和专业课的教学工作，通过教学与科研的紧密结合，确保了教学内容能适应计算机科学与技术学科的飞速发展，促进教学质量不断提高。

    北京大学软件工程研究所愿意和软件技术领域的研究者和实践者建立广泛的学术、技术交流与合作。
    </p>


</body>
</html>